Product/trunk/DDPs/Framework/IIS/xml/notify-EventLossOccured.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessages.xsd http://www.tmforum.org/mtop/fmw/xsd/elo/v1 ../xsd/EventLossOccured.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header>
    <m:header xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1">
      <m:activityName>Notification</m:activityName>
      <m:msgName>notify</m:msgName>
      <m:msgType>NOTIFICATION</m:msgType>
      <m:senderURI>http://www.altova.com</m:senderURI>
      <m:destinationURI>http://www.altova.com</m:destinationURI>
      <m:security>String</m:security>
      <m:securityType>String</m:securityType>
      <m:priority>String</m:priority>
      <m:msgSpecificProperties>
        <m:property>
          <m:propName>String</m:propName>
          <m:propValue>String</m:propValue>
        </m:property>
      </m:msgSpecificProperties>
      <m:communicationPattern>Notification</m:communicationPattern>
      <m:communicationStyle>RPC</m:communicationStyle>
      <m:timestamp>2001-12-17T09:30:47.0Z</m:timestamp>
      <m:vendorExtensions/>
    </m:header>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <m:notify xmlns:m="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1">
      <m:topic>String</m:topic>
      <m:message>
        <m0:eventLossOccured xmlns:m0="http://www.tmforum.org/mtop/fmw/xsd/elo/v1" xmlns:m1="http://www.tmforum.org/mtop/fmw/xsd/cei/v1">
          <m1:notificationId>String</m1:notificationId>
          <m1:sourceTime>2001-12-17T09:30:47.0Z</m1:sourceTime>
          <m1:vendorExtensions/>
          <!-- Removed JM Jan24, 2008 - as redundant with objectName which also identifies the objectType
          <m2:objectType>OS</m2:objectType>-->
          <m0:objectName>
            <nam:object xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1">
              <nam:type>OS</nam:type>
              <nam:name>string</nam:name>
            </nam:object>
          </m0:objectName>
          <m0:startTime>2001-12-17T09:30:47.0Z</m0:startTime>
          <m0:firstEventLostNotificationId>1</m0:firstEventLostNotificationId>
        </m0:eventLossOccured>
      </m:message>
    </m:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
